{"@context":{"@language":"en-us","CIP100":"https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#","CIP136":"https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#","hashAlgorithm":"CIP100:hashAlgorithm","body":{"@id":"CIP136:body","@context":{"references":{"@id":"CIP100:references","@container":"@set","@context":{"GovernanceMetadata":"CIP100:GovernanceMetadataReference","Other":"CIP100:OtherReference","label":"CIP100:reference-label","uri":"CIP100:reference-uri","RelevantArticles":"CIP136:RelevantArticles"}},"summary":"CIP136:summary","rationaleStatement":"CIP136:rationaleStatement","precedentDiscussion":"CIP136:precedentDiscussion","counterargumentDiscussion":"CIP136:counterargumentDiscussion","conclusion":"CIP136:conclusion","internalVote":{"@id":"CIP136:internalVote","@container":"@set","@context":{"constitutional":"CIP136:constitutional","unconstitutional":"CIP136:unconstitutional","abstain":"CIP136:abstain","didNotVote":"CIP136:didNotVote"}}}},"authors":{"@id":"CIP100:authors","@container":"@set","@context":{"did":"@id","name":"http://xmlns.com/foaf/0.1/name","witness":{"@id":"CIP100:witness","@context":{"witnessAlgorithm":"CIP100:witnessAlgorithm","publicKey":"CIP100:publicKey","signature":"CIP100:signature"}}}}},"hashAlgorithm":"blake2b-256","body":{"govActionId":"gov_action1n9hdlcmshrj3hee4g8n4fxdgrprpxp0r03l6psd3j0evtpck0nrsqm57age","summary":"I’m voting YES on the Cardano 2030 Vision & Strategy because it is a solid, usable guide that serves as a practical compass for prioritising proposals and funding against the seven strategic imperatives.","rationaleStatement":"A [PDF version][pdf-link] of this rationale is also made available.\n\n[pdf-link]: https://ipfs.io/ipfs/QmQbtg1xDhjKSAPBMJDaK5TtYnwtGtNJxnjArdPFYePPzN\n\nHaving a good (but not perfect) strategy is better than having no strategy at all; this Vision & Strategy is good enough to implement now, and if a better version emerges later, it can be adopted. It aligns with how the community thinks about Cardano (e.g., abstraction of blockchain complexity, academic engagement, vibrant communities, etc).\n\nWith the vision as a North Star and our strategy as our compass, it helps assess whether governance actions -especially treasury withdrawals- advance the seven strategic imperatives and contribute to KPI progress, which can also ease DRep fatigue by making alignment checks faster and more consistent.\n\nIt also sets shared expectations for builders, institutions (including founding entities), the community, and governance actors about what matters most and where effort should be focused.\n\nA major omission, in my view, is the limited treatment of governance as a strategic pillar. The strategy should explicitly recognise on‑chain institutions (DReps, SPOs, and the Constitutional Committee) and set decentralisation and participation goals, not just operational decentralisation via SPO incentives or multi‑client efforts. Without this, the ecosystem risks overlooking improvements to governance processes and tooling, including the need for broader DRep participation and decentralisation (we currently have a serious issue with DRep decentralisation!) and better decision‑making support.\n\nI would also like this document to include a more condensed, one‑sentence message that’s easy to remember. For example, a mission statement such as: “We aspire to become the world’s financial operating system”. This message would stick in mind and be easy to recall in everyday decisions and in all the interactions we have (both inside and outside our ecosystem).\n\nSome DReps have expressed concerns that this Strategic Plan is rather abstract and vague. However, specific actions and tasks are not supposed to be included in the Strategy; these belong in tactical or action plans. Vision is the destination—where we want to go (e.g., place “A”); strategy is the direction/route we would take (e.g., we will arrive by car via the national highway); and action plans are how exactly we will get there, that is, the step‑by‑step schedule (e.g., take the car from A to Z, then Z to Y, etc.). Therefore, for the purposes of defining our Vision and Strategy, this document perfectly articulates the routes we need to take to realise our Vision.\n\nOn KPIs: some are specific and well defined (e.g., annual L1 revenue, daily meaningful transactions), while others feel vague. Preferably, either fully specify all KPIs with data sources and review cycles, or keep them uniformly generic until we are in a position to articulate them in detail. It would also be very helpful to disclose how Intersect’s Product Committee arrived at those specific KPIs (for example, why a $200 million target and not $150 or $250).","references":[{"@type":"Other","label":"Rationale PDF","uri":"ipfs://QmQbtg1xDhjKSAPBMJDaK5TtYnwtGtNJxnjArdPFYePPzN"}]}}
