{"@context":{"@language":"en-us","CIP100":"https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#","CIP136":"https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#","hashAlgorithm":"CIP100:hashAlgorithm","body":{"@id":"CIP136:body","@context":{"references":{"@id":"CIP100:references","@container":"@set","@context":{"GovernanceMetadata":"CIP100:GovernanceMetadataReference","Other":"CIP100:OtherReference","label":"CIP100:reference-label","uri":"CIP100:reference-uri","RelevantArticles":"CIP136:RelevantArticles"}},"summary":"CIP136:summary","rationaleStatement":"CIP136:rationaleStatement","precedentDiscussion":"CIP136:precedentDiscussion","counterargumentDiscussion":"CIP136:counterargumentDiscussion","conclusion":"CIP136:conclusion","internalVote":{"@id":"CIP136:internalVote","@container":"@set","@context":{"constitutional":"CIP136:constitutional","unconstitutional":"CIP136:unconstitutional","abstain":"CIP136:abstain","didNotVote":"CIP136:didNotVote"}}}},"authors":{"@id":"CIP100:authors","@container":"@set","@context":{"did":"@id","name":"http://xmlns.com/foaf/0.1/name","witness":{"@id":"CIP100:witness","@context":{"witnessAlgorithm":"CIP100:witnessAlgorithm","publicKey":"CIP100:publicKey","signature":"CIP100:signature"}}}}},"hashAlgorithm":"blake2b-256","body":{"govActionId":"gov_action1ypajyms3pcfmkx93r87dxy6jpc8u6pst90ylhxj7t0rwjj43puasq0x9jrw","summary":"I have decided to vote \"NO\" on this governance action after much thought and going back and forth between “Yes,” “No,” and “Abstain.” Detailed rationale is below.","rationaleStatement":"A [PDF version][pdf-link] of this rationale is also made available.\n\n[pdf-link]: https://ipfs.io/ipfs/Qmc4FFvac9g1varUGUqQRtz2bUsG7w5UcNECoQ1WSBVqTV\n\nI have decided to vote **No** on this governance action.\n\nFirstly, this was one of my toughest governance decisions to date. I found myself swinging between “yes”, “no”, and “abstain” multiple times.\n\nSecondly, I want to express my admiration for Yuta’s effort in drafting this new version of the Constitution. I understand this is a huge undertaking, and his commitment is truly remarkable and inspiring.\n\nI appreciate the addition of much-needed definitions (which were missing in the first version), the correction of typos and errors, and the overall improvement in wording.\n\nI also welcome the effort to streamline the budget process by removing the extra step of the budget info action prior to treasury withdrawals.\n\nHowever, there is one point I strongly oppose: the requirement to disclose the location and identity of treasury withdrawal recipients. While I understand concerns about accountability, my experience shows that fraud or mismanagement can still occur even when real identities are exposed. On the contrary, forcing disclosure of real location and identity - beyond raising privacy concerns and being antithetical to Blockchain ethos - could expose individuals to serious, even life-threatening risks in some parts of the world. I encourage voluntary disclosure but oppose making it mandatory, as this could exclude pseudonymous participants or put some at grave risk.\n\nI strongly encourage a further iteration based on version 2.0, incorporating more community input and a more thorough review. I envision the discussion proceeding in three parts:\n\n- Typos and errors: The quickest to confirm\n- Removal of the budget Info Action: A relatively fast decision with a simple yes/no option\n- Examination of the new simplified wording and text changes: A slower process requiring careful review to avoid important omissions, ambiguity, and to ensure that all changes are thoroughly examined and well understood.","references":[{"@type":"Other","label":"Rationale PDF","uri":"ipfs://Qmc4FFvac9g1varUGUqQRtz2bUsG7w5UcNECoQ1WSBVqTV"}]}}