{"@context":{"@language":"en-us","CIP100":"https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#","CIP136":"https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#","hashAlgorithm":"CIP100:hashAlgorithm","body":{"@id":"CIP136:body","@context":{"references":{"@id":"CIP100:references","@container":"@set","@context":{"GovernanceMetadata":"CIP100:GovernanceMetadataReference","Other":"CIP100:OtherReference","label":"CIP100:reference-label","uri":"CIP100:reference-uri","RelevantArticles":"CIP136:RelevantArticles"}},"summary":"CIP136:summary","rationaleStatement":"CIP136:rationaleStatement","precedentDiscussion":"CIP136:precedentDiscussion","counterargumentDiscussion":"CIP136:counterargumentDiscussion","conclusion":"CIP136:conclusion","internalVote":{"@id":"CIP136:internalVote","@container":"@set","@context":{"constitutional":"CIP136:constitutional","unconstitutional":"CIP136:unconstitutional","abstain":"CIP136:abstain","didNotVote":"CIP136:didNotVote"}}}},"authors":{"@id":"CIP100:authors","@container":"@set","@context":{"did":"@id","name":"http://xmlns.com/foaf/0.1/name","witness":{"@id":"CIP100:witness","@context":{"witnessAlgorithm":"CIP100:witnessAlgorithm","publicKey":"CIP100:publicKey","signature":"CIP100:signature"}}}}},"hashAlgorithm":"blake2b-256","body":{"govActionId":"gov_action1u4jrcvlkppjzuv5j9z5ksacwtvv77h6glu0knpcjut8gvjjfu0cqqt3alsy","summary":"I've decided to vote yes on the Stablecoin DeFi Liquidity Budget Proposal.","rationaleStatement":"A [PDF version][pdf-link] of this rationale is also made available.\n\n[pdf-link]: https://ipfs.io/ipfs/QmYP84J9b3qryi7V99cpg54acm885A2jFsXuY6ePAASm8b\n\nThis proposal doesn't come without concerns, but nonetheless I've decided to upvote it based on the below rationale:\n\n- Cardano undeniably faces big challenges in the DeFi ecosystem. Our TVL is very low compared to major competitors such as Ethereum and Solana. Especially stablecoins lack liquidity depth. This proposal directly addresses this issue.\n\n- This proposal has strategic alignment with institutions inside Cardano. More specifically, the Cardano Foundation's 2025 roadmap explicitly commits to providing an eight-figure ada amount in liquidity to key Cardano stablecoin projects.\n\n- Black Swan incidents like the one which happened on 10th of October 2025, provided us with concrete evidence of the liquidity constraints of our ecosystem (Liqwid Finance protocol).\n\n- I interpret this proposal more like an investment than an expense. As I have already stated I have a more conservative approach to treasury spending and we have already reached my personal threshold for this year, but since this amount will not be spent but invested with an expected return and the possibility to have it returned back, I am ok.\n\n- Shallow liquidity in our ecosystem causes us serious problems with user and institutional adoption: high slippage 4%-6% which makes us totally uncompetitive (worse than banks in the legacy world!) and more difficult for user on/off ramps, limited institutional participation due to liquidity constraints, etc.\n\n- Alignment with Cardano Vision & Strategy: Based on Cardano's long-term strategy and leadership statements: Cardano aims to become the financial operating system of the world. How can we express those claims without liquidity in DeFi & stablecoins?\n\n## Concerns & Reservations\nThis proposal carries with it some concerns which I have tried to evaluate and address:\n\n- Centralization risk of a small committee: This can be addressed by introducing more community members to the committee\n\n- No committee member has demonstrated treasury management of that scale: This is not active portfolio management but a conversion under specific terms & conditions that are predetermined. Also community oversight and help, including the tDAO will help mitigate those risks.\n\n- Price impact: Based on the proposed methodology (including OTC, gradual liquidation, volume distribution, etc), I really don't think the impact will be noticeable.\n\n- Picking winners / losers: This is my biggest concern so far. Hopefully tDAO will have strong oversight over committee selection. Also I strongly encourage gradual rotation of funds to other stablecoins: The initial incoming liquidity would have a positive effect on Cardano's DeFi, attracting more capital inflows and allowing the fund to rotate some of the allocated funds to other stablecoins over time. If we fail to attract new inflows though, there's a real threat to the remaining stablecoins if no rotation takes place. I expect CF's pledge to also help in this area (with their commitment to provide liquidity).","references":[{"@type":"Other","label":"Rationale PDF","uri":"ipfs://QmYP84J9b3qryi7V99cpg54acm885A2jFsXuY6ePAASm8b"}]}}